In [1]:
import pandas as pd

In [2]:
file_path = "/workspaces/Datapipline/resource/data_with_nan.csv"

df = pd.read_csv(file_path)

# pandas的空值是Nan
df

    col1  col2 col3
0  test1  13.0  NaN
1  test2  44.0  aaa
2  test3   NaN  NaN
3    NaN   NaN  NaN
4  test5   NaN  bbb
5    NaN   NaN  NaN

In [5]:
# Calculate on NaN, NaN will be skipped
df['col2'].mean()

np.float64(28.5)

In [6]:
df['col2'].sum()

np.float64(57.0)

In [8]:
df['col1'].isna()

0    False
1    False
2    False
3     True
4    False
5     True
Name: col1, dtype: bool

In [7]:
# 列出na, .isna()
df[
    df['col1'].isna()
]

  col1  col2 col3
3  NaN   NaN  NaN
5  NaN   NaN  NaN

In [9]:
df['col1'].notna()

0     True
1     True
2     True
3    False
4     True
5    False
Name: col1, dtype: bool

In [11]:
# 列出非na, .notna()
df[
    df['col1'].notna()
]

# 可以用~直接讓結果反向
df[
    ~df['col1'].isna()
]

    col1  col2 col3
0  test1  13.0  NaN
1  test2  44.0  aaa
2  test3   NaN  NaN
4  test5   NaN  bbb

In [12]:
# 對所有資料做drop na
df.dropna()

    col1  col2 col3
1  test2  44.0  aaa

In [13]:
# 用how來決定怎麼drop, all會只drop全部是na的. 預設是any, 會drop掉有任一有na的row
df.dropna(how='all')

    col1  col2 col3
0  test1  13.0  NaN
1  test2  44.0  aaa
2  test3   NaN  NaN
4  test5   NaN  bbb

In [14]:
# thresh不能和how共用, 可以設定閥值, 當一個row>=2個na則drop

df.dropna(thresh=2)

    col1  col2 col3
0  test1  13.0  NaN
1  test2  44.0  aaa
4  test5   NaN  bbb

In [16]:
# 空值捕0, 一樣需要assign
df['col2_fill0'] = df['col2'].fillna(0)

In [17]:
df

    col1  col2 col3  col2_fill0
0  test1  13.0  NaN        13.0
1  test2  44.0  aaa        44.0
2  test3   NaN  NaN         0.0
3    NaN   NaN  NaN         0.0
4  test5   NaN  bbb         0.0
5    NaN   NaN  NaN         0.0

In [19]:
# 用前一個值去補
df['col1'].fillna(method = 'ffill')
df['col1'].ffill()

/tmp/ipykernel_5398/6950162.py:2: FutureWarning: Series.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df['col1'].fillna(method = 'ffill')

0    test1
1    test2
2    test3
3    test3
4    test5
5    test5
Name: col1, dtype: object

In [20]:
# 用後一個值去補
df['col1'].bfill()

0    test1
1    test2
2    test3
3    test5
4    test5
5      NaN
Name: col1, dtype: object